app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "enrique"], ["text", "aviles"], ["created_at", "2020-06-28 20:21:19.937285"], ["updated_at", "2020-06-28 20:21:19.937285"]]

    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "holas"], ["text", "primer texto 1"], ["updated_at", "2020-06-28 20:02:11.471410"], ["id", 1]]